semickolon/fak/src/inc/ch552.h
/*--------------------------------------------------------------------------
CH552.H
Header file for CH552 microcontrollers.
****************************************
**  Copyright  (C)  W.ch  1999-2016   **
**  Web:              http://wch.cn   **
****************************************
--------------------------------------------------------------------------*/

// Blocks: __CH552_H__, __USB_DEF__

#ifndef __CH552_H__
#define __CH552_H__

#include <compiler.h>
#include <stdint.h>

/*----- SFR --------------------------------------------------------------*/
/*  sbit are bit addressable, others are byte addressable */

/*  System Registers  */
SFR(PSW, 0xD0);          // program status word
SBIT(CY, 0xD0, 7);       // carry flag
SBIT(AC, 0xD0, 6);       // auxiliary carry flag
SBIT(F0, 0xD0, 5);       // bit addressable general purpose flag 0
SBIT(RS1, 0xD0, 4);      // register R0-R7 bank selection high bit
SBIT(RS0, 0xD0, 3);      // register R0-R7 bank selection low bit
#define MASK_PSW_RS 0x18 // bit mask of register R0-R7 bank selection
                         // RS1 & RS0: register R0-R7 bank selection
                         //    00 - bank 0, R0-R7 @ address 0x00-0x07
                         //    01 - bank 1, R0-R7 @ address 0x08-0x0F
                         //    10 - bank 2, R0-R7 @ address 0x10-0x17
                         //    11 - bank 3, R0-R7 @ address 0x18-0x1F
SBIT(OV, 0xD0, 2);       // overflow flag
SBIT(F1, 0xD0, 1);       // bit addressable general purpose flag 1
SBIT(P, 0xD0, 0);        // ReadOnly: parity flag
SFR(ACC, 0xE0);          // accumulator
SFR(B, 0xF0);            // general purpose register B
SFR(SP, 0x81);           // stack pointer
SFR16(DPTR, 0x82);       // DPTR pointer, little-endian
SFR(DPL, 0x82);          // data pointer low
SFR(DPH, 0x83);          // data pointer high
SFR(SAFE_MOD, 0xA1);     // WriteOnly: writing safe mode
SFR(CHIP_ID, 0xA1);      // ReadOnly: reading chip ID
#define CHIP_ID SAFE_MOD
SFR(GLOBAL_CFG, 0xB1);   // global config, Write@SafeMode
#define bBOOT_LOAD 0x20  // ReadOnly: boot loader status for discriminating BootLoader or Application: set 1 by power on reset, clear 0 by software reset
#define bSW_RESET 0x10   // software reset bit, auto clear by hardware
#define bCODE_WE 0x08    // enable flash-ROM (include code & Data-Flash) being program or erasing: 0=writing protect, 1=enable program and erase
#define bDATA_WE 0x04    // enable Data-Flash (flash-ROM data area) being program or erasing: 0=writing protect, 1=enable program and erase
#define bLDO3V3_OFF 0x02 // disable 5V->3.3V LDO: 0=enable LDO for USB and internal oscillator under 5V power, 1=disable LDO, V33 pin input external 3.3V power
#define bWDOG_EN 0x01    // enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow

/* Clock and Sleep and Power Registers */
SFR(PCON, 0x87);           // power control and reset flag
#define SMOD 0x80          // baud rate selection for UART0 mode 1/2/3: 0=slow(Fsys/128 @mode2, TF1/32 @mode1/3, no effect for TF2),
                           //   1=fast(Fsys/32 @mode2, TF1/16 @mode1/3, no effect for TF2)
#define bRST_FLAG1 0x20    // ReadOnly: recent reset flag high bit
#define bRST_FLAG0 0x10    // ReadOnly: recent reset flag low bit
#define MASK_RST_FLAG 0x30 // ReadOnly: bit mask of recent reset flag
#define RST_FLAG_SW 0x00
#define RST_FLAG_POR 0x10
#define RST_FLAG_WDOG 0x20
#define RST_FLAG_PIN 0x30
// bPC_RST_FLAG1 & bPC_RST_FLAG0: recent reset flag
//    00 - software reset, by bSW_RESET=1 @(bBOOT_LOAD=0 or bWDOG_EN=1)
//    01 - power on reset
//    10 - watch-dog timer overflow reset
//    11 - external input manual reset by RST pin
#define GF1 0x08             // general purpose flag bit 1
#define GF0 0x04             // general purpose flag bit 0
#define PD 0x02              // power-down enable bit, auto clear by wake-up hardware
SFR(CLOCK_CFG, 0xB9);        // system clock config: lower 3 bits for system clock Fsys, Write@SafeMode
#define bOSC_EN_INT 0x80     // internal oscillator enable and original clock selection: 1=enable & select internal clock, 0=disable & select external clock
#define bOSC_EN_XT 0x40      // external oscillator enable, need quartz crystal or ceramic resonator between XI and XO pins
#define bWDOG_IF_TO 0x20     // ReadOnly: watch-dog timer overflow interrupt flag, cleared by reload watch-dog count or auto cleared when MCU enter interrupt routine
#define bROM_CLK_FAST 0x10   // flash-ROM clock frequency selection: 0=normal(for Fosc>=16MHz), 1=fast(for Fosc<16MHz)
#define bRST 0x08            // ReadOnly: pin RST input
#define bT2EX_ 0x08          // alternate pin for T2EX
#define bCAP2_ 0x08          // alternate pin for CAP2
#define MASK_SYS_CK_SEL 0x07 // bit mask of system clock Fsys selection
/*
   Fxt = 24MHz(8MHz~25MHz for non-USB application), from external oscillator @XI&XO
   Fosc = bOSC_EN_INT ? 24MHz : Fxt
   Fpll = Fosc * 4 => 96MHz (32MHz~100MHz for non-USB application)
   Fusb4x = Fpll / 2 => 48MHz (Fixed)
              MASK_SYS_CK_SEL[2] [1] [0]
   Fsys = Fpll/3   =  32MHz:  1   1   1
   Fsys = Fpll/4   =  24MHz:  1   1   0
   Fsys = Fpll/6   =  16MHz:  1   0   1
   Fsys = Fpll/8   =  12MHz:  1   0   0
   Fsys = Fpll/16  =   6MHz:  0   1   1
   Fsys = Fpll/32  =   3MHz:  0   1   0
   Fsys = Fpll/128 = 750KHz:  0   0   1
   Fsys = Fpll/512 =187.5KHz: 0   0   0
*/
SFR(WAKE_CTRL, 0xA9);      // wake-up control, Write@SafeMode
#define bWAK_BY_USB 0x80   // enable wake-up by USB event
#define bWAK_RXD1_LO 0x40  // enable wake-up by RXD1 low level
#define bWAK_P1_5_LO 0x20  // enable wake-up by pin P1.5 low level
#define bWAK_P1_4_LO 0x10  // enable wake-up by pin P1.4 low level
#define bWAK_P1_3_LO 0x08  // enable wake-up by pin P1.3 low level
#define bWAK_RST_HI 0x04   // enable wake-up by pin RST high level
#define bWAK_P3_2E_3L 0x02 // enable wake-up by pin P3.2 (INT0) edge or pin P3.3 (INT1) low level
#define bWAK_RXD0_LO 0x01  // enable wake-up by RXD0 low level
SFR(RESET_KEEP, 0xFE);     // value keeper during reset
SFR(WDOG_COUNT, 0xFF);     // watch-dog count, count by clock frequency Fsys/65536

/*  Interrupt Registers  */
#define IE_ADDR (0xA8)         // interrupt enable address
SFR(IE, IE_ADDR);              // interrupt enable
SBIT(EA, IE_ADDR, 7);          // enable global interrupts: 0=disable, 1=enable if E_DIS=0
SBIT(E_DIS, IE_ADDR, 6);       // disable global interrupts, intend to inhibit interrupt during some flash-ROM operation: 0=enable if EA=1, 1=disable
SBIT(ET2, IE_ADDR, 5);         // enable timer2 interrupt
SBIT(ES, IE_ADDR, 4);          // enable UART0 interrupt
SBIT(ET1, IE_ADDR, 3);         // enable timer1 interrupt
SBIT(EX1, IE_ADDR, 2);         // enable external interrupt INT1
SBIT(ET0, IE_ADDR, 1);         // enable timer0 interrupt
SBIT(EX0, IE_ADDR, 0);         // enable external interrupt INT0
#define IP_ADDR (0xB8)         // interrupt priority and current priority address
SFR(IP, IP_ADDR);              // interrupt priority and current priority
SBIT(PH_FLAG, IP_ADDR, 7);     // ReadOnly: high level priority action flag
SBIT(PL_FLAG, IP_ADDR, 6);     // ReadOnly: low level priority action flag
                               // PH_FLAG & PL_FLAG: current interrupt priority
                               //    00 - no interrupt now
                               //    01 - low level priority interrupt action now
                               //    10 - high level priority interrupt action now
                               //    11 - unknown error
SBIT(PT2, IP_ADDR, 5);         // timer2 interrupt priority level
SBIT(PS, IP_ADDR, 4);          // UART0 interrupt priority level
SBIT(PT1, IP_ADDR, 3);         // timer1 interrupt priority level
SBIT(PX1, IP_ADDR, 2);         // external interrupt INT1 priority level
SBIT(PT0, IP_ADDR, 1);         // timer0 interrupt priority level
SBIT(PX0, IP_ADDR, 0);         // external interrupt INT0 priority level
#define IE_EX_ADDR (0xE8)      // extend interrupt enable
SFR(IE_EX, IE_EX_ADDR);        // extend interrupt enable
SBIT(IE_WDOG, IE_EX_ADDR, 7);  // enable watch-dog timer interrupt
SBIT(IE_GPIO, IE_EX_ADDR, 6);  // enable GPIO input interrupt
SBIT(IE_PWMX, IE_EX_ADDR, 5);  // enable PWM1/2 interrupt
SBIT(IE_UART1, IE_EX_ADDR, 4); // enable UART1 interrupt
SBIT(IE_ADC, IE_EX_ADDR, 3);   // enable ADC interrupt
SBIT(IE_USB, IE_EX_ADDR, 2);   // enable USB interrupt
SBIT(IE_TKEY, IE_EX_ADDR, 1);  // enable touch-key timer interrupt
SBIT(IE_SPI0, IE_EX_ADDR, 0);  // enable SPI0 interrupt
SFR(IP_EX, 0xE9);              // extend interrupt priority
#define bIP_LEVEL 0x80         // ReadOnly: current interrupt nested level: 0=no interrupt or two levels, 1=one level
#define bIP_GPIO 0x40          // GPIO input interrupt priority level
#define bIP_PWMX 0x20          // PWM1/2 interrupt priority level
#define bIP_UART1 0x10         // UART1 interrupt priority level
#define bIP_ADC 0x08           // ADC interrupt priority level
#define bIP_USB 0x04           // USB interrupt priority level
#define bIP_TKEY 0x02          // touch-key timer interrupt priority level
#define bIP_SPI0 0x01          // SPI0 interrupt priority level
SFR(GPIO_IE, 0xC7);            // GPIO interrupt enable
#define bIE_IO_EDGE 0x80       // enable GPIO edge interrupt: 0=low/high level, 1=falling/rising edge
#define bIE_RXD1_LO 0x40       // enable interrupt by RXD1 low level / falling edge
#define bIE_P1_5_LO 0x20       // enable interrupt by pin P1.5 low level / falling edge
#define bIE_P1_4_LO 0x10       // enable interrupt by pin P1.4 low level / falling edge
#define bIE_P1_3_LO 0x08       // enable interrupt by pin P1.3 low level / falling edge
#define bIE_RST_HI 0x04        // enable interrupt by pin RST high level / rising edge
#define bIE_P3_1_LO 0x02       // enable interrupt by pin P3.1 low level / falling edge
#define bIE_RXD0_LO 0x01       // enable interrupt by RXD0 low level / falling edge

