semickolon/fak/src/inc/ch552.h
/*  UART1 Registers  */
#define SCON1_ADDR (0xC0)    // UART1 control (serial port control) address
SFR(SCON1, SCON1_ADDR);      // UART1 control (serial port control)
SBIT(U1SM0, SCON1_ADDR, 7);  // UART1 mode, selection data bit: 0=8 bits data, 1=9 bits data
SBIT(U1SMOD, SCON1_ADDR, 5); // UART1 2X baud rate selection: 0=slow(Fsys/32/(256-SBAUD1)), 1=fast(Fsys/16/(256-SBAUD1))
SBIT(U1REN, SCON1_ADDR, 4);  // enable UART1 receiving
SBIT(U1TB8, SCON1_ADDR, 3);  // the 9th transmitted data bit in 9 bits data mode
SBIT(U1RB8, SCON1_ADDR, 2);  // 9th data bit received in 9 bits data mode, or stop bit received for 8 bits data mode
SBIT(U1TI, SCON1_ADDR, 1);   // transmit interrupt flag, set by hardware after completion of a serial transmittal, need software clear
SBIT(U1RI, SCON1_ADDR, 0);   // receive interrupt flag, set by hardware after completion of a serial receiving, need software clear
SFR(SBUF1, 0xC1);            // UART1 data buffer: reading for receiving, writing for transmittal
SFR(SBAUD1, 0xC2);           // UART1 baud rate setting

/*  ADC and comparator Registers  */
#define ADC_CTRL_ADDR (0x80)       // ADC control address
SFR(ADC_CTRL, ADC_CTRL_ADDR);      // ADC control
SBIT(CMPO, ADC_CTRL_ADDR, 7);      // ReadOnly: comparator result input
SBIT(CMP_IF, ADC_CTRL_ADDR, 6);    // flag for comparator result changed, direct bit address clear
SBIT(ADC_IF, ADC_CTRL_ADDR, 5);    // interrupt flag for ADC finished, direct bit address clear
SBIT(ADC_START, ADC_CTRL_ADDR, 4); // set 1 to start ADC, auto cleared when ADC finished
SBIT(CMP_CHAN, ADC_CTRL_ADDR, 3);  // comparator IN- input channel selection: 0=AIN1, 1=AIN3
SBIT(ADC_CHAN1, ADC_CTRL_ADDR, 1); // ADC/comparator IN+ channel selection high bit
SBIT(ADC_CHAN0, ADC_CTRL_ADDR, 0); // ADC/comparator IN+ channel selection low bit
// ADC_CHAN1 & ADC_CHAN0: ADC/comparator IN+ channel selection
//   00: AIN0(P1.1)
//   01: AIN1(P1.4)
//   10: AIN2(P1.5)
//   11: AIN3(P3.2)
SFR(ADC_CFG, 0x9A);   // ADC config
#define bADC_EN 0x08  // control ADC power: 0=shut down ADC, 1=enable power for ADC
#define bCMP_EN 0x04  // control comparator power: 0=shut down comparator, 1=enable power for comparator
#define bADC_CLK 0x01 // ADC clock frequency selection: 0=slow clock, 384 Fosc cycles for each ADC, 1=fast clock, 96 Fosc cycles for each ADC
SFR(ADC_DATA, 0x9F);  // ReadOnly: ADC data

/*  Touch-key timer Registers  */
SFR(TKEY_CTRL, 0xC3);   // touch-key control
#define bTKC_IF 0x80    // ReadOnly: interrupt flag for touch-key timer, cleared by writing touch-key control or auto cleared when start touch-key checking
#define bTKC_2MS 0x10   // touch-key timer cycle selection: 0=1mS, 1=2mS
#define bTKC_CHAN2 0x04 // touch-key channel selection high bit
#define bTKC_CHAN1 0x02 // touch-key channel selection middle bit
#define bTKC_CHAN0 0x01 // touch-key channel selection low bit
// bTKC_CHAN2 & bTKC_CHAN1 & bTKC_CHAN0: touch-key channel selection
//   000: disable touch-key
//   001: TIN0(P1.0)
//   010: TIN1(P1.1)
//   011: TIN2(P1.4)
//   100: TIN3(P1.5)
//   101: TIN4(P1.6)
//   110: TIN5(P1.7)
//   111: enable touch-key but disable all channel
SFR16(TKEY_DAT, 0xC4); // ReadOnly: touch-key data, little-endian
SFR(TKEY_DATL, 0xC4);  // ReadOnly: low byte of touch-key data
SFR(TKEY_DATH, 0xC5);  // ReadOnly: high byte of touch-key data
#define bTKD_CHG 0x80  // ReadOnly: indicate control changed, current data maybe invalid

/*  USB/Host/Device Registers  */
SFR(USB_C_CTRL, 0x91);    // USB type-C control
#define bVBUS2_PD_EN 0x80 // USB VBUS2 10K pulldown resistance: 0=disable, 1=enable pullup
#define bUCC2_PD_EN 0x40  // USB CC2 5.1K pulldown resistance: 0=disable, 1=enable pulldown
#define bUCC2_PU1_EN 0x20 // USB CC2 pullup resistance control high bit
#define bUCC2_PU0_EN 0x10 // USB CC2 pullup resistance control low bit
#define bVBUS1_PD_EN 0x08 // USB VBUS1 10K pulldown resistance: 0=disable, 1=enable pullup
#define bUCC1_PD_EN 0x04  // USB CC1 5.1K pulldown resistance: 0=disable, 1=enable pulldown
#define bUCC1_PU1_EN 0x02 // USB CC1 pullup resistance control high bit
#define bUCC1_PU0_EN 0x01 // USB CC1 pullup resistance control low bit
// bUCC?_PU1_EN & bUCC?_PU0_EN: USB CC pullup resistance selection
//   00: disable pullup resistance
//   01: enable 56K pullup resistance for default USB power
//   10: enable 22K pullup resistance for 1.5A USB power
//   11: enable 10K pullup resistance for 3A USB power
SFR(UDEV_CTRL, 0xD1);      // USB device physical port control
#define bUD_PD_DIS 0x80    // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define bUD_DP_PIN 0x20    // ReadOnly: indicate current UDP pin level
#define bUD_DM_PIN 0x10    // ReadOnly: indicate current UDM pin level
#define bUD_LOW_SPEED 0x04 // enable USB physical port low speed: 0=full speed, 1=low speed
#define bUD_GP_BIT 0x02    // general purpose bit
#define bUD_PORT_EN 0x01   // enable USB physical port I/O: 0=disable, 1=enable
// sfr UHOST_CTRL      = 0xD1;         // USB host physical port control
#define UHOST_CTRL UDEV_CTRL
#define bUH_PD_DIS 0x80     // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define bUH_DP_PIN 0x20     // ReadOnly: indicate current UDP pin level
#define bUH_DM_PIN 0x10     // ReadOnly: indicate current UDM pin level
#define bUH_LOW_SPEED 0x04  // enable USB port low speed: 0=full speed, 1=low speed
#define bUH_BUS_RESET 0x02  // control USB bus reset: 0=normal, 1=force bus reset
#define bUH_PORT_EN 0x01    // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached
SFR(UEP1_CTRL, 0xD2);       // endpoint 1 control
#define bUEP_R_TOG 0x80     // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define bUEP_T_TOG 0x40     // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1
#define bUEP_AUTO_TOG 0x10  // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define bUEP_R_RES1 0x08    // handshake response type high bit for USB endpoint X receiving (OUT)
#define bUEP_R_RES0 0x04    // handshake response type low bit for USB endpoint X receiving (OUT)
#define MASK_UEP_R_RES 0x0C // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define UEP_R_RES_ACK 0x00
#define UEP_R_RES_TOUT 0x04
#define UEP_R_RES_NAK 0x08
#define UEP_R_RES_STALL 0x0C
// bUEP_R_RES1 & bUEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define bUEP_T_RES1 0x02    // handshake response type high bit for USB endpoint X transmittal (IN)
#define bUEP_T_RES0 0x01    // handshake response type low bit for USB endpoint X transmittal (IN)
#define MASK_UEP_T_RES 0x03 // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define UEP_T_RES_ACK 0x00
#define UEP_T_RES_TOUT 0x01
#define UEP_T_RES_NAK 0x02
#define UEP_T_RES_STALL 0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
SFR(UEP1_T_LEN, 0xD3);                  // endpoint 1 transmittal length
SFR(UEP2_CTRL, 0xD4);                   // endpoint 2 control
SFR(UEP2_T_LEN, 0xD5);                  // endpoint 2 transmittal length
SFR(UEP3_CTRL, 0xD6);                   // endpoint 3 control
SFR(UEP3_T_LEN, 0xD7);                  // endpoint 3 transmittal length
#define USB_INT_FG_ADDR (0xD8)          // USB interrupt flag address
SFR(USB_INT_FG, USB_INT_FG_ADDR);       // USB interrupt flag
SBIT(U_IS_NAK, USB_INT_FG_ADDR, 7);     // ReadOnly: indicate current USB transfer is NAK received
SBIT(U_TOG_OK, USB_INT_FG_ADDR, 6);     // ReadOnly: indicate current USB transfer toggle is OK
SBIT(U_SIE_FREE, USB_INT_FG_ADDR, 5);   // ReadOnly: indicate USB SIE free status
SBIT(UIF_FIFO_OV, USB_INT_FG_ADDR, 4);  // FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
SBIT(UIF_HST_SOF, USB_INT_FG_ADDR, 3);  // host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
SBIT(UIF_SUSPEND, USB_INT_FG_ADDR, 2);  // USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
SBIT(UIF_TRANSFER, USB_INT_FG_ADDR, 1); // USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
SBIT(UIF_DETECT, USB_INT_FG_ADDR, 0);   // device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
SBIT(UIF_BUS_RST, USB_INT_FG_ADDR, 0);  // bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear
SFR(USB_INT_ST, 0xD9);                  // ReadOnly: USB interrupt status
#define bUIS_IS_NAK 0x80                // ReadOnly: indicate current USB transfer is NAK received for USB device mode
#define bUIS_TOG_OK 0x40                // ReadOnly: indicate current USB transfer toggle is OK
#define bUIS_TOKEN1 0x20                // ReadOnly: current token PID code bit 1 received for USB device mode
#define bUIS_TOKEN0 0x10                // ReadOnly: current token PID code bit 0 received for USB device mode
#define MASK_UIS_TOKEN 0x30             // ReadOnly: bit mask of current token PID code received for USB device mode
#define UIS_TOKEN_OUT 0x00
#define UIS_TOKEN_SOF 0x10
#define UIS_TOKEN_IN 0x20
#define UIS_TOKEN_SETUP 0x30
// bUIS_TOKEN1 & bUIS_TOKEN0: current token PID code received for USB device mode
//   00: OUT token PID received
//   01: SOF token PID received
//   10: IN token PID received
//   11: SETUP token PID received
#define MASK_UIS_ENDP 0x0F    // ReadOnly: bit mask of current transfer endpoint number for USB device mode
#define MASK_UIS_H_RES 0x0F   // ReadOnly: bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received
SFR(USB_MIS_ST, 0xDA);        // ReadOnly: USB miscellaneous status
#define bUMS_SOF_PRES 0x80    // ReadOnly: indicate host SOF timer presage status
#define bUMS_SOF_ACT 0x40     // ReadOnly: indicate host SOF timer action status for USB host
#define bUMS_SIE_FREE 0x20    // ReadOnly: indicate USB SIE free status
#define bUMS_R_FIFO_RDY 0x10  // ReadOnly: indicate USB receiving FIFO ready status (not empty)
#define bUMS_BUS_RESET 0x08   // ReadOnly: indicate USB bus reset status
#define bUMS_SUSPEND 0x04     // ReadOnly: indicate USB suspend status
#define bUMS_DM_LEVEL 0x02    // ReadOnly: indicate UDM level saved at device attached to USB host
#define bUMS_DEV_ATTACH 0x01  // ReadOnly: indicate device attached status on USB host
SFR(USB_RX_LEN, 0xDB);        // ReadOnly: USB receiving length
SFR(UEP0_CTRL, 0xDC);         // endpoint 0 control
SFR(UEP0_T_LEN, 0xDD);        // endpoint 0 transmittal length
SFR(UEP4_CTRL, 0xDE);         // endpoint 4 control
SFR(UEP4_T_LEN, 0xDF);        // endpoint 4 transmittal length
SFR(USB_INT_EN, 0xE1);        // USB interrupt enable
#define bUIE_DEV_SOF 0x80     // enable interrupt for SOF received for USB device mode
#define bUIE_DEV_NAK 0x40     // enable interrupt for NAK responded for USB device mode
#define bUIE_FIFO_OV 0x10     // enable interrupt for FIFO overflow
#define bUIE_HST_SOF 0x08     // enable interrupt for host SOF timer action for USB host mode
#define bUIE_SUSPEND 0x04     // enable interrupt for USB suspend or resume event
#define bUIE_TRANSFER 0x02    // enable interrupt for USB transfer completion
#define bUIE_DETECT 0x01      // enable interrupt for USB device detected event for USB host mode
#define bUIE_BUS_RST 0x01     // enable interrupt for USB bus reset event for USB device mode
SFR(USB_CTRL, 0xE2);          // USB base control
#define bUC_HOST_MODE 0x80    // enable USB host mode: 0=device mode, 1=host mode
#define bUC_LOW_SPEED 0x40    // enable USB low speed: 0=full speed, 1=low speed
#define bUC_DEV_PU_EN 0x20    // USB device enable and internal pullup resistance enable
#define bUC_SYS_CTRL1 0x20    // USB system control high bit
#define bUC_SYS_CTRL0 0x10    // USB system control low bit
#define MASK_UC_SYS_CTRL 0x30 // bit mask of USB system control
// bUC_HOST_MODE & bUC_SYS_CTRL1 & bUC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force UDP/UDM output SE0 state
//   1 10: enable USB host and force UDP/UDM output J state
//   1 11: enable USB host and force UDP/UDM output resume or K state
#define bUC_INT_BUSY 0x08  // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define bUC_RESET_SIE 0x04 // force reset USB SIE, need software clear
#define bUC_CLR_ALL 0x02   // force clear FIFO and count of USB
#define bUC_DMA_EN 0x01    // DMA enable and DMA interrupt enable for USB
SFR(USB_DEV_AD, 0xE3);     // USB device address, lower 7 bits for USB device address
#define bUDA_GP_BIT 0x80   // general purpose bit
#define MASK_USB_ADDR 0x7F // bit mask for USB device address
SFR16(UEP2_DMA, 0xE4);     // endpoint 2 buffer start address, little-endian
SFR(UEP2_DMA_L, 0xE4);     // endpoint 2 buffer start address low byte
SFR(UEP2_DMA_H, 0xE5);     // endpoint 2 buffer start address high byte
SFR16(UEP3_DMA, 0xE6);     // endpoint 3 buffer start address, little-endian
SFR(UEP3_DMA_L, 0xE6);     // endpoint 3 buffer start address low byte
SFR(UEP3_DMA_H, 0xE7);     // endpoint 3 buffer start address high byte
SFR(UEP4_1_MOD, 0xEA);     // endpoint 4/1 mode
#define bUEP1_RX_EN 0x80   // enable USB endpoint 1 receiving (OUT)
#define bUEP1_TX_EN 0x40   // enable USB endpoint 1 transmittal (IN)
#define bUEP1_BUF_MOD 0x10 // buffer mode of USB endpoint 1
// bUEPn_RX_EN & bUEPn_TX_EN & bUEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define bUEP4_RX_EN 0x08 // enable USB endpoint 4 receiving (OUT)
#define bUEP4_TX_EN 0x04 // enable USB endpoint 4 transmittal (IN)
// bUEP4_RX_EN & bUEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes
SFR(UEP2_3_MOD, 0xEB);     // endpoint 2/3 mode
#define bUEP3_RX_EN 0x80   // enable USB endpoint 3 receiving (OUT)
#define bUEP3_TX_EN 0x40   // enable USB endpoint 3 transmittal (IN)
#define bUEP3_BUF_MOD 0x10 // buffer mode of USB endpoint 3
#define bUEP2_RX_EN 0x08   // enable USB endpoint 2 receiving (OUT)
#define bUEP2_TX_EN 0x04   // enable USB endpoint 2 transmittal (IN)
#define bUEP2_BUF_MOD 0x01 // buffer mode of USB endpoint 2
SFR16(UEP0_DMA, 0xEC);     // endpoint 0 buffer start address, little-endian
SFR(UEP0_DMA_L, 0xEC);     // endpoint 0 buffer start address low byte
SFR(UEP0_DMA_H, 0xED);     // endpoint 0 buffer start address high byte
SFR16(UEP1_DMA, 0xEE);     // endpoint 1 buffer start address, little-endian
SFR(UEP1_DMA_L, 0xEE);     // endpoint 1 buffer start address low byte
SFR(UEP1_DMA_H, 0xEF);     // endpoint 1 buffer start address high byte

